/*

¬ариант 1

b) —оздать класс Set Ц множество целых чисел, использу€ динамическую пам€ть. 
ќпределить операторы работы с множествами: "+" Ц объединение, "*" Ц пересечение, 
"-" вычитание, как дружественные функции, а "+=" Ц включение нового элемента в множество, 
"==" Ц сравнени€ на равенство, и др. как методы класса. ќпределить операторы "<<" и ">>". 
“акже определить функцию определени€ принадлежности элемента множеству.

*/


#include "var1_functions_lab3_2.cpp"


int main(void) {

	setlocale(LC_ALL, "Rus");
	
	Set A, B, C, D, E, F;

	A += 2;
	A += 5;
	A += 6;
	A += 7;
	A += 9;
	A.print("A");

	B += 1;
	B += 2;
	B += 2;
	B += 2;
	B.print("B");

	C = A + B;
	C.print("C");

	C = A - B;
	cout << "ѕечать объекта C:" << endl;
	cout << C << endl;

	C = A * B;
	cout << "ѕечать объекта C:" << endl;
	cout << C << endl;

	E += 2;
	E += 1;
	E += 4;
	E += 2;

	F += 1;
	F += 4;
	F += 2;
	F += 2;

	E.print("E");
	F.print("F");

	cout << "\nE == F\nќтвет: ";
	if (E == F)
		cout << "Da\n";
	else
		cout << "No\n";

	cout << "\nE != F\nќтвет: ";
	if (E != F)
		cout << "Da\n";
	else
		cout << "No\n";
	
	cout << "\nќпределение принадлежности элемента множеству:" << endl;
	cout << "ѕринадлежит ли цифра 4 множеству F?\n\n";
	F.print("F");
	cout << "ќтвет: ";
	if (F.belongSet(4))
		cout << "Da\n";
	else
		cout << "No\n";

	cout << "\n¬вод объекта D:" << endl;
	cin >> D;
	D.print("D");

	system("pause");
	return 0;
}
